<a href="https://colab.research.google.com/github/levinaanora/Toyota-Car-Price-Prediction/blob/main/toyota_car_predict_price.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
#import library yang dibutuhkan
import pandas as pd
import seaborn as sn
import numpy as np
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression

In [11]:
data = pd.read_csv("toyota.csv")
data

               model  year  price transmission  ...  fuelType  tax   mpg  engineSize
0               GT86  2016  16000       Manual  ...    Petrol  265  36.2         2.0
1               GT86  2017  15995       Manual  ...    Petrol  145  36.2         2.0
2               GT86  2015  13998       Manual  ...    Petrol  265  36.2         2.0
3               GT86  2017  18998       Manual  ...    Petrol  150  36.2         2.0
4               GT86  2017  17498       Manual  ...    Petrol  145  36.2         2.0
...              ...   ...    ...          ...  ...       ...  ...   ...         ...
6733              IQ  2011   5500    Automatic  ...    Petrol   20  58.9         1.0
6734   Urban Cruiser  2011   4985       Manual  ...    Petrol  125  50.4         1.3
6735   Urban Cruiser  2012   4995       Manual  ...    Diesel  125  57.6         1.4
6736   Urban Cruiser  2011   3995       Manual  ...    Petrol  125  50.4         1.3
6737   Urban Cruiser  2011   4495       Manual  ...    Petrol  125  50.4         1.3

[6738 rows x 9 columns]

In [12]:
data.describe()

              year         price  ...          mpg   engineSize
count  6738.000000   6738.000000  ...  6738.000000  6738.000000
mean   2016.748145  12522.391066  ...    63.042223     1.471297
std       2.204062   6345.017587  ...    15.836710     0.436159
min    1998.000000    850.000000  ...     2.800000     0.000000
25%    2016.000000   8290.000000  ...    55.400000     1.000000
50%    2017.000000  10795.000000  ...    62.800000     1.500000
75%    2018.000000  14995.000000  ...    69.000000     1.800000
max    2020.000000  59995.000000  ...   235.000000     4.500000

[8 rows x 6 columns]

In [25]:
del data["model"], data["transmission"], data["fuelType"]

In [26]:
data.columns

Index(['year', 'price', 'mileage', 'tax', 'mpg', 'engineSize'], dtype='object')

In [27]:
data.isnull().sum()

year          0
price         0
mileage       0
tax           0
mpg           0
engineSize    0
dtype: int64

In [28]:
data.head()

   year  price  mileage  tax   mpg  engineSize
0  2016  16000    24089  265  36.2         2.0
1  2017  15995    18615  145  36.2         2.0
2  2015  13998    27469  265  36.2         2.0
3  2017  18998    14736  150  36.2         2.0
4  2017  17498    36284  145  36.2         2.0

In [41]:
X = data.drop(columns =["price"])
y = data["price"]

In [42]:
X

      year  mileage  tax   mpg  engineSize
0     2016    24089  265  36.2         2.0
1     2017    18615  145  36.2         2.0
2     2015    27469  265  36.2         2.0
3     2017    14736  150  36.2         2.0
4     2017    36284  145  36.2         2.0
...    ...      ...  ...   ...         ...
6733  2011    30000   20  58.9         1.0
6734  2011    36154  125  50.4         1.3
6735  2012    46000  125  57.6         1.4
6736  2011    60700  125  50.4         1.3
6737  2011    45128  125  50.4         1.3

[6738 rows x 5 columns]

In [43]:
y

0       16000
1       15995
2       13998
3       18998
4       17498
        ...
6733     5500
6734     4985
6735     4995
6736     3995
6737     4495
Name: price, Length: 6738, dtype: int64

In [44]:
X_train, X_test, y_train, y_test = train_test_split(X, y , test_size=0.2, random_state=42)

In [45]:
X_train.shape

(5390, 5)

In [46]:
y_train.shape

(5390,)

In [47]:
linreg = LinearRegression()
linreg.fit(X_train, y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [48]:
y_pred = linreg.predict(X_test)

In [49]:
new_df = {
    'y_test' : y_test,
    'y_pred' : y_pred
}
evaluate = pd.DataFrame(new_df, columns=['y_test', 'y_pred'])
evaluate

      y_test        y_pred
381    37440  27458.047546
2476    4159   1863.149581
2855   10600  12878.805698
2018    8995  11010.453154
2185   11000  12914.304236
...      ...           ...
4715   10800   8709.716518
5374    7495   6949.281014
1027   10790  14217.063431
2802    9991   7888.979350
3789    8298   8750.443632

[1348 rows x 2 columns]

In [50]:
linreg.score(X_test, y_test)

0.7658935417346331